Repository: corlin/Floraboard-ios
Catalog: Floreboard/Localizable.xcstrings
Source language: zh_hans
Languages: en, fr, ja, ko

# paywall.plan.pro_monthly.name
source: Pro 专业版月卡
en: Pro Monthly Membership
fr: Abonnement Mensuel Pro
ja: Pro 月額メンバーシップ
ko: Pro 월간 멤버십

# paywall.plan.pro_yearly.badge
source: 立省 25%
en: Save 25%
fr: -25% Économie
ja: 25%お得
ko: 25% 절약

# paywall.plan.pro_yearly.desc
source: 全年 4000 点数，折合 $7.4/月，点数跨周期滚动
en: 4,000 credits/yr ($7.4/mo), rollover unused credits
fr: 4 000 crédits/an (soit 7,4 $/mois), report des crédits non utilisés
ja: 年間4000クレジット（月額換算$7.4）、繰り越し可能
ko: 연간 4000 크레딧(월 $7.4 상당), 미사용 크레딧 이월

# paywall.plan.pro_yearly.name
source: Pro 专业版年卡
en: Pro Annual Membership
fr: Abonnement Annuel Pro
ja: Pro 年間メンバーシップ
ko: Pro 연간 멤버십

# paywall.popular
source: 热门推荐
en: Popular
fr: Populaire
ja: 人気
ko: 인기 추천

# paywall.priceMonthly
source: $9.90/月
en: $9.90/mo
fr: 9,90 $/mois
ko: $9.90/월

# paywall.priceYearly
source: $89.00/年
en: $89.00/yr
fr: 89,00 $/an
ko: $89.00/년

# paywall.proBadge
source: PRO 会员
en: PRO Member
fr: Membre PRO
ja: PRO 会員
ko: PRO 멤버

# paywall.proMonthly
source: Pro 专业版月卡
en: Pro Monthly Membership
fr: Abonnement Mensuel Pro
ja: Pro 月額メンバーシップ
ko: Pro 월간 멤버십

# paywall.proMonthlyDesc
source: 每月自动注入 300 点数，解锁高峰期优先生成
en: 300 credits injected monthly, priority peak generation
fr: 300 crédits injectés par mois, génération prioritaire en période de pointe
ja: 毎月300クレジット自動付与、混雑時も優先生成
ko: 매월 300 크레딧 자동 지급, 피크 시간대 우선 생성

# paywall.proYearly
source: Pro 专业版年卡
en: Pro Annual Membership
fr: Abonnement Annuel Pro
ja: Pro 年間メンバーシップ
ko: Pro 연간 멤버십

# paywall.proYearlyDesc
source: 全年 4000 点数，折合 $7.4/月，点数跨周期滚动
en: 4,000 credits/yr ($7.4/mo), rollover unused credits
fr: 4 000 crédits/an (soit 7,4 $/mois), report des crédits non utilisés
ja: 年間4000クレジット（月額換算$7.4）、繰り越し可能
ko: 연간 4000 크레딧(월 $7.4 상당), 미사용 크레딧 이월

# paywall.save25
source: 立省 25%
en: Save 25%
fr: -25% Économie
ja: 25%お得
ko: 25% 절약

# paywall.skip
source: 稍后再说
en: Maybe Later
fr: Plus tard
ja: 後で
ko: 나중에 하기

# paywall.status.failed
source: 处理失败: {{error}}
en: Processing failed: {{error}}
fr: Échec du traitement : {{error}}
ja: 処理に失敗しました: {{error}}
ko: 처리에 실패했습니다: {{error}}

# paywall.status.processing
source: 正在处理购买...
en: Processing purchase...
fr: Traitement de l'achat en cours...
ja: 購入を処理しています...
ko: 구매를 처리 중입니다...

# paywall.status.success
source: 充值成功！
en: Purchase successful!
fr: Achat effectué avec succès !
ja: チャージに成功しました！
ko: 충전이 성공적으로 완료되었습니다!

# paywall.status.uncompleted
source: 购买未完成: {{error}}
en: Purchase not completed: {{error}}
fr: Achat non finalisé : {{error}}
ja: 購入が完了していません: {{error}}
ko: 구매가 완료되지 않았습니다: {{error}}

# paywall.status.updated
source: 充值成功！已更新点数
en: Success! Credits updated
fr: Succès ! Crédits mis à jour
ja: 成功しました！クレジットが更新されました
ko: 성공! 크레딧이 업데이트되었습니다

# paywall.subtitle
source: 尊享大模型极速方案设计与 4K 商业效果图渲染
en: Unlock lightning AI design generation & 4K commercial renders
fr: Profitez de la génération IA ultra-rapide et de rendus 4K commerciaux
ja: 超高速AI花芸デザインと4K商業レンダリングを体験
ko: 초고속 AI 디자인 생성 및 4K 상업용 렌더링 혜택

# paywall.title
source: 升级会员与点数充值
en: Upgrade Membership & Credits
fr: Mise à niveau et Recharges de Crédits
ja: 会員アップグレード＆クレジットチャージ
ko: 멤버십 업그레이드 및 크레딧 충전

# poster.client.aesthetic
source: 美学诠释
en: Aesthetics
fr: Interprétation Esthétique
ja: 美学的解釈
ko: 미학적 해석

# poster.client.palette
source: 配色方案
en: Color Palette
fr: Palette de Couleurs
ja: 配色パレット
ko: 컬러 팔레트

# poster.client.retail_price
source: 作品售价
en: Price
fr: Prix de Vente
ja: 販売価格
ko: 판매가

# poster.mode.client
source: 客户鉴赏海报
en: Customer Poster
fr: Affiche Client
ja: 顧客向けポスター
ko: 고객용 포스터

# poster.mode.florist
source: 花艺师制作单
en: Florist Sheet
fr: Fiche Fleuriste
ja: フローリスト制作シート
ko: 플로리스트 제작표

# pro.prop.7_5_3.name
source: 花道 7:5:3
en: Ikebana 7:5:3
fr: Ikebana 7:5:3
ja: いけばな 7:5:3
ko: 꽃꽂이 7:5:3

# pro.prop.free.name
source: 自由比例
en: Free Proportion
fr: Style Libre
ja: フリースタイル
ko: 프리스타일

# pro.prop.golden_ratio.name
source: 黄金比例
en: Golden Ratio
fr: Nombre d'Or
ja: 黄金比
ko: 황금비

# pro.school.chinese_literati.name
source: 中国文人花
en: Chinese Literati
fr: Fleur de Lettré
ja: 文人花
ko: 문인화

# pro.school.chinese_zen.name
source: 东方禅花
en: Chinese Zen
fr: Fleur Zen
ja: 禅花
ko: 선화 (禪花)

# pro.school.fusion.name
source: 融合现代
en: Fusion Contemporary
fr: Fusion
ja: フュージョン
ko: 퓨전

# pro.school.japanese_ikenobo.name
source: 池坊流
en: Ikenobo
fr: Ikenobo
ja: 池坊
ko: 이케노보

# pro.school.japanese_ohara.name
source: 小原流
en: Ohara-ryu
fr: Ohara
ko: 오하라류

# pro.school.japanese_sogetsu.name
source: 草月流
en: Sogetsu
fr: Sogetsu
ko: 소게츠류

# pro.school.western_biedermeier.name
source: 比德迈尔
en: Biedermeier
fr: Biedermeier
ja: ビーダーマイヤー
ko: 비더마이어

# pro.school.western_english.name
source: 英式花园
en: English Garden
fr: Jardin Anglais
ja: イングリッシュガーデン
ko: 잉글리시 가든

# pro.season.all.name
source: 🌈 四季通用
en: 🌈 All Seasons
fr: 🌈 Toutes Saisons
ja: 🌈 四季通年
ko: 🌈 사계절 통년

# pro.season.autumn.name
source: 🍂 秋实
en: 🍂 Autumn
fr: 🍂 Automne
ja: 🍂 秋
ko: 🍂 가을

# pro.season.spring.name
source: 🌸 春生
en: 🌸 Spring
fr: 🌸 Printemps
ja: 🌸 春
ko: 🌸 봄

# pro.season.summer.name
source: 🌻 夏繁
en: 🌻 Summer
fr: 🌻 Été
ja: 🌻 夏
ko: 🌻 여름

# pro.season.winter.name
source: ❄️ 冬清
en: ❄️ Winter
fr: ❄️ Hiver
ja: ❄️ 冬
ko: ❄️ 겨울

# pro.tech.cascade.name
source: 瀑布流坠
en: Cascade Style
fr: Cascade
ja: キャスケード
ko: 캐스케이드

# pro.tech.kenzan.name
source: 剑山固定
en: Kenzan Pin Holder
fr: Kenzan (Pique-fleurs)
ja: 剣山留め
ko: 침봉

# pro.tech.oasis.name
source: 花泥插制
en: Floral Foam
fr: Mousse Florale (Oasis)
ja: 吸水スポンジ
ko: 플로럴 폼

# pro.tech.parallel.name
source: 平行架构
en: Parallel Arrangement
fr: Parallèle
ja: パラレル（平行）
ko: 파라렐 (평행)

# pro.tech.pave.name
source: 铺面密植
en: Pavé Design
fr: Pavé
ja: パヴェ（敷き詰め）
ko: 파붸 (깔기)

# pro.tech.spiral_hand_tied.name
source: 螺旋手绑
en: Spiral Hand-tied
fr: Spirale (Bouquet rond)
ja: スパイラル（手組み）
ko: 스파이럴 (핸드타이드)

# pro.tech.wiring.name
source: 铁丝技法
en: Wiring & Taping
fr: Montage sur Fil
ja: ワイヤリング
ko: 와이어링

# purchase.cost
source: 进价
en: Unit Cost
fr: Prix Achat
ja: 仕入値
ko: 매입가

# purchase.estimated_total
source: 预估采买总额
en: Estimated Total
fr: Total Estimé
ja: 概算仕入総額
ko: 예상 총 발주액

# purchase.need
source: 补货量
en: Restock Qty
fr: Qté à Commander
ja: 補充数
ko: 발주량

# purchase.no_low_stock
source: 当前库存充盈，无需紧急采买
en: Inventory is healthy. No urgent restocking required.
fr: Stock suffisant. Aucun réapprovisionnement urgent requis.
ja: 在庫は十分です。緊急仕入れの必要はありません。
ko: 현재 재고가 충분하여 긴급 발주가 필요하지 않습니다.

# purchase.notes
source: 备注说明
en: Notes
fr: Notes
ja: 備考
ko: 비고

# purchase.supplier_note
source: 花市采购推荐清单
en: Flower Market Restock List
fr: Liste d'Approvisionnement Marché
ja: 花市場 仕入れ推奨リスト
ko: 화훼시장 발주 추천 목록

# purchase.title
source: 采买建议单
en: Purchase Order
fr: Bon de Commande Fournisseur
ja: 仕入れ提案書
ko: 구매 발주서

# result.bom.title
source: 花材配比清单
en: Bill of Materials
fr: Composition Florale
ja: 花材構成表
ko: 꽃재료 구성표

# result.cost.title
source: 成本与定价核算
en: Cost & Pricing
fr: Coût et Tarification
ja: 原価・価格計算
ko: 원가 및 판매가 산출

# result.imageError.title
source: 效果图渲染异常
en: Rendering Error
fr: Erreur de Rendu
ja: レンダリングエラー
ko: 렌더링 오류

# result.meaning.title
source: 设计立意与花语
en: Flower Meaning & Concept
fr: Langage des Fleurs et Concept
ja: 花言葉とデザインコンセプト
ko: 꽃말 및 디자인 콘셉트

# result.steps.title
source: 插花制作指导
en: Arrangement Instructions
fr: Instructions de Confection
ja: 生け込み制作手順
ko: 꽃꽂이 제작 단계

# result.title
source: 花艺方案详情
en: Design Proposal
fr: Proposition de Design
ja: デザインプラン詳細
ko: 디자인 제안서 상세

# settings.account
source: 店铺与账号
en: Shop & Account
fr: Boutique & Compte
ja: 店舗・アカウント
ko: 매장 및 계정

# settings.aiService
source: AI 生成引擎
en: AI Generation Engine
fr: Moteur de Génération IA
ja: AI 生成エンジン
ko: AI 생성 엔진

# settings.aiServiceManaged
source: 官方全托管高速通道 (Cloudflare Edge)
en: Managed Edge Service (Cloudflare Edge)
fr: Service Officiel Managé (Cloudflare Edge)
ja: 公式フルマネージド高速チャンネル (Cloudflare Edge)
ko: 공식 풀매니지드 고속 채널 (Cloudflare Edge)

# settings.aiServiceManagedDesc
source: 免配置 API Key，开箱即用，已由系统统一调度加速。
en: No API Key required. Plug and play, accelerated by global edge.
fr: Aucune clé requise. Prêt à l'emploi, accéléré par le réseau Edge.
ja: APIキーの設定は不要。箱から出してすぐに高速利用可能です。
ko: API 키 설정 불필요. 글로벌 엣지로 가속화되어 즉시 사용 가능합니다.

# settings.aiServiceMode
source: AI 服务接入模式
en: AI Access Mode
fr: Mode d'Accès IA
ja: AI 接続モード
ko: AI 연결 모드

# settings.api.description
source: 配置兼容 OpenAI 格式的文生图接口信息
en: Configure OpenAI-compatible text-to-image interface info
fr: Configurer les informations de l'interface texte-vers-image compatible OpenAI
ja: OpenAI 互換の画像生成インターフェース情報を設定
ko: OpenAI 호환 텍스트-이미지 인터페이스 정보 설정

# settings.api.imageModel
source: 绘图模型 (Image Gen)
en: Image Generation Model
fr: Modèle de Génération d'Image (Image Gen)
ja: 作画モデル (Image Gen)
ko: 이미지 생성 모델 (Image Gen)

# settings.api.imageModelDesc
source: 用于生成最终效果图 (Supports wanx/dall-e/gemini)
en: For generating final rendering (Supports wanx/dall-e/gemini)
fr: Utilisé pour générer le rendu final (Supports wanx/dall-e/gemini)
ja: 最終的なイメージ図の生成に使用 (Supports wanx/dall-e/gemini)
ko: 최종 예상도 생성에 사용 (Supports wanx/dall-e/gemini)

# settings.api.manualInput
source: 手动输入...
en: Manual input...
fr: Saisie manuelle...
ja: 手動入力...
ko: 직접 입력...

# settings.api.model
source: 模型
en: Model
fr: Modèle
ja: モデル
ko: 모델

# settings.api.provider
source: 服务提供商 (Provider)
en: Service Provider
fr: Fournisseur de Service (Provider)
ja: サービスプロバイダー (Provider)
ko: 서비스 제공자 (Provider)

# settings.api.selectPlaceholder
source: 选择...
en: Select...
fr: Sélectionner...
ja: 選択...
ko: 선택하세요...

# settings.api.textModel
source: 文本推理模型 (Reasoning)
en: Text Reasoning Model
fr: Modèle de Raisonnement Texte (Reasoning)
ja: テキスト推論モデル (Reasoning)
ko: 텍스트 추론 모델 (Reasoning)

# settings.api.textModelDesc
source: 用于生成方案逻辑、花语与步骤 (Need Strong Reasoning)
en: For generating logic, flower language and steps (Need Strong Reasoning)
fr: Utilisé pour la logique, le langage des fleurs et les étapes (Need Strong Reasoning)
ja: ロジック、花言葉、手順の生成に使用 (Need Strong Reasoning)
ko: 논리, 꽃말, 단계 생성에 사용 (Need Strong Reasoning)

# settings.api.title
source: API 接入配置
en: API Configuration
fr: Configuration API
ja: API 接続設定
ko: API 연결 구성

# settings.api.visionModel
source: 视觉分析模型 (Vision)
en: Visual Analysis Model
fr: Modèle d'Analyse Visuelle (Vision)
ja: 視覚分析モデル (Vision)
ko: 시각 분석 모델 (Vision)

# settings.api.visionModelDesc
source: 用于[以图生花]功能，分析图片的色调与风格 (Need Vision Capability)
en: For [Visual Muse], analyzing color and style (Need Vision Capability)
fr: Pour la fonction 'Images vers Fleurs', analyse les tons et le style (Need Vision Capability)
ja: 「画像から花へ」機能で、画像の色調とスタイルを分析 (Need Vision Capability)
ko: '이미지로 꽃 만들기' 기능에서 이미지의 색조와 스타일 분석 (Need Vision Capability)

# settings.apiKey
source: 自定义 API Key
en: Custom API Key
fr: Clé API Personnalisée
ja: カスタム API キー
ko: 사용자 지정 API 키

# settings.apiProvider
source: API 提供商
en: API Provider
fr: Fournisseur API
ja: API プロバイダー
ko: API 제공자

# settings.budget.threshold
source: 预警阈值
en: Alert Threshold
fr: Seuil d'Alerte
ja: アラート閾値
ko: 경고 임계값

# settings.budget.title
source: 预算风控
en: Budget Control
fr: Contrôle Budgétaire
ja: 予算管理
ko: 예산 관리

# settings.budget.total
source: 总预算
en: Total Budget
fr: Budget Total
ja: 総予算
ko: 총 예산

# settings.businessRules
source: 花店业务参数
en: Business Rules
fr: Règles Commerciales
ja: 店舗業務ルール
ko: 매장 비즈니스 규칙

# settings.credits.consume
source: 点数消耗
en: Credit Usage
fr: Consommation
ja: クレジット消費
ko: 크레딧 사용

# settings.credits.empty
source: 暂无点数收支明细
en: No transactions yet
fr: Aucune transaction
ja: 利用履歴はありません
ko: 이용 내역이 없습니다

# settings.credits.expires_at
source: 到期: {{date}}
en: Expires: {{date}}
fr: Expire le : {{date}}
ja: 有効期限: {{date}}
ko: 만료일: {{date}}

# settings.credits.recent_title
source: 近期账单明细
en: Recent Transactions
fr: Dernières transactions
ja: 最近の利用履歴
ko: 최근 이용 내역

# settings.credits.remaining
source: 当前剩余点数
en: Available Credits
fr: Crédits disponibles
ja: 現在の利用可能クレジット
ko: 현재 보유 크레딧

# settings.credits.tier_enterprise
source: 旗舰商户
en: Enterprise
fr: Entreprise
ja: エンタープライズ
ko: 엔터프라이즈

# settings.credits.tier_free
source: 免费体验
en: Free Tier
fr: Essai Gratuit
ja: 無料体験
ko: 무료 체험

# settings.credits.tier_pro
source: PRO 专业版
en: Pro Member
fr: Membre PRO
ja: PRO プロ会員
ko: PRO 프로 회원

# settings.credits.title
source: 会员与点数中心
en: Membership & Credits
fr: Adhésions et Centre de Crédits
ja: 会員プラン＆クレジットセンター
ko: 멤버십 및 크레딧 센터

# settings.credits.top_up
source: 充值到账
en: Top-up Credited
fr: Recharge reçue
ja: チャージ完了
ko: 충전 완료

# settings.credits.unit
source: 点
en: pts
fr: pts
ko: 포인트

# settings.credits.upgrade_button
source: 充值点数 / 升级会员
en: Top Up / Upgrade Membership
fr: Recharger / Mettre à niveau
ja: クレジットチャージ / 会員アップグレード
ko: 크레딧 충전 / 멤버십 업그레이드

# settings.currentLanguage
source: 当前语言
en: Current Language
fr: Langue actuelle
ja: 現在の言語
ko: 현재 언어

# settings.defaultBudget
source: 默认方案预算 (元)
en: Default Budget (CNY)
fr: Budget par Défaut
ja: デフォルト予算 (円)
ko: 기본 예산 (원)

# settings.endpoint
source: 接口 Base URL
en: API Base URL
fr: URL de Base
ja: ベース URL
ko: API 기본 URL

# settings.fetching_quota
source: 正在同步点数...
en: Syncing credits...
fr: Synchronisation des crédits...
ja: クレジットを同期中...
ko: 크레딧 동기화 중...

# settings.imageEndpoint
source: 生图 API 地址
en: Image API URL
fr: URL API Image
ja: 作画 API アドレス
ko: 이미지 API 주소

# settings.imageModel
source: 绘图模型
en: Image Model
fr: Modèle d'Image
ja: 作画モデル
ko: 이미지 생성 모델

# settings.language
source: 应用界面语言
en: App Language
fr: Langue de l'Application
ja: 言語設定
ko: 앱 언어

# settings.logout
source: 退出登录
en: Sign Out
fr: Se Déconnecter
ja: ログアウト
ko: 로그아웃

# settings.logoutConfirmMessage
source: 确定要退出当前工作区吗？本地离线缓存将被妥善保留。
en: Are you sure you want to sign out? Offline cache is preserved.
fr: Voulez-vous vous déconnecter ? Le cache hors ligne sera conservé.
ja: ログアウトしますか？オフラインキャッシュは安全に保持されます。
ko: 로그아웃하시겠습니까? 오프라인 캐시는 안전하게 유지됩니다.

# settings.logoutConfirmTitle
source: 退出登录确认
en: Sign Out Confirmation
fr: Confirmation de Déconnexion
ja: ログアウト確認
ko: 로그아웃 확인

# settings.logoutHint
source: 退出后需要重新输入凭据登录。
en: Credentials required upon next sign-in.
fr: Vos identifiants seront requis à la prochaine connexion.
ja: ログアウト後は再度認証が必要になります。
ko: 로그아웃 후 다시 로그인해야 합니다.

# settings.lowStockWarning
source: 低库存预警阈值 (枝)
en: Low Stock Threshold (stems)
fr: Seuil d'Alerte Stock Bas (tiges)
ja: 低在庫アラート閾値 (本)
ko: 재고 부족 경고 임계값 (송이)

# settings.modelName
source: 文本模型名称
en: Text Model Name
fr: Nom du Modèle Texte
ja: テキストモデル名
ko: 텍스트 모델명

# settings.provider
source: 服务商
en: Provider
fr: Fournisseur
ja: プロバイダー
ko: 제공자

# settings.quota
source: 点数额度
en: Quota
fr: Quota
ja: 利用可能枠
ko: 한도

# settings.quota_balance
source: 剩余点数: %lld
en: Remaining: %lld
fr: Restant : %lld
ja: 残り: %lld
ko: 잔여: %lld

# settings.region.current
source: 当前
en: Current
fr: Actuel
ja: 現在の
ko: 현재

# settings.region.description
source: 选择数据存储节点，影响访问速度和数据合规
en: Select data storage node, affects speed and compliance
fr: Choisissez le nœud de stockage des données (impacte la vitesse et la conformité)
ja: データ保存ノードを選択（速度とコンプライアンスに影響）
ko: 속도 및 규정 준수에 영향을 미치는 데이터 저장 노드 선택

# settings.region.options.aliyun.desc
source: 阿里云服务，适合中国大陆用户
en: Aliyun Service, for mainland China users
fr: Service Alibaba Cloud (Utilisateurs Chine continentale)
ja: Alibaba Cloud サービス (中国本土ユーザー向け)
ko: Alibaba Cloud 서비스 (중국 본토 사용자용)

# settings.region.options.aliyun.name
source: 中国节点
en: China Node
fr: Nœud Chine
ja: 中国ノード
ko: 중국 노드

# settings.region.options.cloudflare.desc
source: Cloudflare Workers & D1 全球边缘计算，极速响应
en: Cloudflare Workers & D1 global edge, ultra-fast
fr: Cloudflare Workers & D1 Edge global, vitesse ultra-rapide
ja: Cloudflare Workers & D1 グローバルエッジコンピューティング、超高速レスポンス
ko: Cloudflare Workers & D1 글로벌 엣지 컴퓨팅, 초고속 응답

# settings.region.options.cloudflare.name
source: Cloudflare 边缘节点
en: Cloudflare Edge
fr: Nœud Cloudflare Edge
ja: Cloudflare エッジノード
ko: Cloudflare 엣지 노드

# settings.region.options.local.desc
source: 数据存储在浏览器本地，无需网络
en: Data stored locally in browser, offline
fr: Stocké dans le navigateur, pas de réseau requis
ja: ブラウザ内に保存、ネットワーク不要
ko: 브라우저 로컬 저장, 네트워크 불필요

# settings.region.options.local.name
source: 本地存储
en: Local Storage
fr: Stockage Local
ja: ローカル保存
ko: 로컬 저장

# settings.region.options.supabase.desc
source: Supabase 云服务
en: Supabase Cloud Service
fr: Service Cloud Supabase (Utilisateurs internationaux)
ja: Supabase クラウドサービス (海外ユーザー向け)
ko: Supabase 클라우드 서비스 (해외 사용자용)

# settings.region.options.supabase.name
source: Supabase 节点
en: Supabase Node
fr: Nœud Étranger
ja: 海外ノード
ko: 해외 노드

# settings.region.refreshTip
source: 刷新页面后生效
en: Effective after refresh
fr: Effectif après actualisation
ja: ページを更新後に有効になります
ko: 페이지 새로고침 후 적용

# settings.region.switched
source: 已切换到{{name}}
en: Switched to {{name}}
fr: Basculé vers {{name}}
ja: {{name}} に切り替えました
ko: {{name}}로 전환되었습니다

# settings.region.tip
source: 💡 中国大陆用户建议选择「中国节点」；海外用户建议选择「海外节点」；离线使用选择「本地存储」。
en: 💡 Mainland China users recommended 'China Node'; Overseas users 'Overseas Node'; Offline use 'Local Storage'.
fr: 💡 Chine continentale : 'Nœud Chine' ; International : 'Nœud Étranger' ; Hors ligne : 'Stockage Local'.
ja: 💡 中国本土のユーザーは「中国ノード」、海外ユーザーは「海外ノード」、オフライン使用は「ローカル保存」を推奨します。
ko: 💡 중국 본토 사용자는 '중국 노드', 해외 사용자는 '해외 노드', 오프라인 사용 시 '로컬 저장'을 권장합니다.

# settings.region.title
source: 数据存储区域
en: Data Storage Region
fr: Région de Stockage
ja: データ保存地域
ko: 데이터 저장 지역

# settings.save.button
source: 保存所有配置
en: Save All Config
fr: Enregistrer la configuration
ja: 設定を保存
ko: 설정 저장

# settings.save.error
source: 保存失败
en: Save failed
fr: Échec de l'enregistrement
ja: 保存に失敗しました
ko: 저장 실패

# settings.save.saving
source: 保存中...
en: Saving...
fr: Enregistrement...
ko: 저장 중...

# settings.save.success
source: 配置已保存
en: Configuration saved
fr: Configuration sauvegardée
ja: 設定を保存しました
ko: 설정이 저장되었습니다

# settings.saveConfig
source: 保存所有配置
en: Save Configuration
fr: Enregistrer la Configuration
ja: 設定を保存
ko: 설정 저장

# settings.saveSuccess
source: 系统设置已更新
en: Settings updated successfully
fr: Paramètres mis à jour
ja: 設定を更新しました
ko: 설정이 업데이트되었습니다

# settings.stock.desc
source: 库存低于此值时显示 <1>红色警示</1>
en: Show <1>Red Alert</1> when below this value
fr: Afficher une <1>Alerte Rouge</1> si le stock est inférieur à cette valeur
ja: 在庫がこの値を下回ると <1>赤色のアラート</1> を表示します
ko: 재고가 이 값보다 낮으면 <1>빨간색 경고</1>를 표시합니다

# settings.stock.threshold
source: 低库存阈值
en: Low Stock Threshold
fr: Seuil de Stock Bas
ja: 低在庫閾値
ko: 재고 부족 임계값

# settings.stock.title
source: 库存预警
en: Stock Alert
fr: Alerte de Stock
ja: 在庫アラート
ko: 재고 경고

# settings.stock.unit
source: 枝
en: stems
fr: Tiges
ja: 本
ko: 송이

# settings.storeName
source: 花店工作区名称
en: Flower Shop Name
fr: Nom de la Boutique
ja: 店舗名
ko: 꽃집 이름

# settings.subscription.buyPack
source: 立即购买
en: Buy Pack
fr: Acheter le pack
ja: 今すぐ購入
ko: 지금 구매

# settings.subscription.creditsBalance
source: 当前可用点数
en: Available Credits
fr: Crédits disponibles actuels
ja: 現在の利用可能クレジット
ko: 현재 사용 가능한 크레딧

# settings.subscription.enterprise
source: 旗舰商户
en: Enterprise
fr: Entreprise
ja: ビジネス会員
ko: 엔터프라이즈

# settings.subscription.free
source: 体验版
en: Free Tier
fr: Version gratuite
ja: 無料体験版
ko: 무료 체험

# settings.subscription.historyEmpty
source: 暂无点数收支记录
en: No credit transactions yet
fr: Aucune transaction pour le moment
ja: クレジット履歴はありません
ko: 크레딧 내역이 없습니다

# settings.subscription.openCheckout
source: 已打开 Waffo 聚合支付收银台
en: Opening Waffo Checkout...
fr: Paiement Waffo ouvert
ja: 決済レジを開きました
ko: 결제창이 열렸습니다

# settings.subscription.paymentSuccessTip
source: 支付完成后请点击刷新以同步最新点数
en: After completing payment, please click refresh to view updated credits
fr: Après le paiement, veuillez actualiser pour synchroniser votre solde
ja: 支払い完了後、更新ボタンを押して最新クレジットを反映してください
ko: 결제 완료 후 새로고침을 눌러 최신 크레딧을 동기화하세요

# settings.subscription.plansTitle
source: 升级会员与点数充值
en: Upgrade Plans & Credit Packs
fr: Formules d'adhésion et Recharges de Crédits
ja: 会員アップグレード＆クレジットチャージ
ko: 멤버십 업그레이드 및 크레딧 충전

# settings.subscription.points
source: 点
en: Credits
fr: pts
ja: ポイント
ko: 포인트

# settings.subscription.popular
source: 超值推荐
en: Most Popular
fr: Recommandé
ja: おすすめ
ko: 인기 추천

# settings.subscription.pro
source: 专业会员
en: Pro Member
fr: Membre Pro
ja: Pro 会員
ko: Pro 프로 회원

# settings.subscription.processing
source: 正在调起安全收银台...
en: Opening checkout...
fr: Ouverture du paiement sécurisé...
ja: 安全な決済ページを呼び出しています...
ko: 보안 결제창을 불러오는 중...

# settings.subscription.refresh
source: 刷新点数
en: Refresh Balance
fr: Actualiser les crédits
ja: クレジットを更新
ko: 크레딧 새로고침

# settings.subscription.ruleEdge
source: Cloudflare 全球边缘直连，免梯极速响应
en: Cloudflare Global Edge direct connection
fr: Connexion directe Cloudflare Global Edge, réponse ultra-rapide
ja: Cloudflare グローバルエッジ直結、超高速レスポンス
ko: Cloudflare 글로벌 엣지 직결, 초고속 응답

# settings.subscription.ruleImage
source: 高清 4K 渲染出图：5 点 / 次
en: HD 4K Floral Rendering: 5 Credits / request
fr: Rendu commercial 4K haute résolution: 5 crédits / image
ja: 高解像度 4K レンダリング出図：1 回 5 クレジット
ko: 고화질 4K 상업 렌더링: 1회당 5 크레딧

# settings.subscription.ruleText
source: AI 花艺设计 / 识花方案：1 点 / 次
en: AI Design / Flower Identification: 1 Credit / request
fr: Design Floral IA / Reconnaissance: 1 crédit / requête
ja: AIフラワーデザイン / 画像解析：1 回 1 クレジット
ko: AI 꽃꽂이 디자인 / 꽃 인식: 1회당 1 크레딧

# settings.subscription.rulesTitle
source: 点数消耗规则
en: Credit Consumption Rules
fr: Règles de consommation des crédits
ja: クレジット消費ルール
ko: 크레딧 차감 규칙

# settings.subscription.subscribe
source: 立即开通
en: Subscribe Now
fr: S'abonner
ja: 今すぐ登録
ko: 지금 가입

# settings.subscription.subtitle
source: 统一基于 Cloudflare 全球边缘服务与 Waffo 聚合收单，享受极速 AI 方案生成与 4K 渲染
en: Powered by Cloudflare Global Edge and Waffo unified payments for high-speed AI generation and 4K renders
fr: Propulsé par Cloudflare Global Edge et paiements Waffo pour une génération IA rapide et rendus 4K
ja: Cloudflare グローバルエッジと Waffo 統合決済を採用、超高速なAI生成と4Kレンダリングを実現
ko: Cloudflare 글로벌 엣지 및 Waffo 통합 결제 기반, 초고속 AI 생성과 4K 렌더링 지원

# settings.subscription.tier
source: 会员等级
en: Membership Tier
fr: Niveau d'adhésion
ja: 会員ランク
ko: 회원 등급

# settings.subscription.title
source: 会员订阅与点数中心
en: Subscription & Credits
fr: Abonnements et Centre de Crédits
ja: 会員プラン＆クレジットセンター
ko: 회원 멤버십 & 크레딧 센터

# settings.subscription.transactionsTitle
source: 点数收支明细
en: Credit Transactions History
fr: Historique des transactions de crédits
ja: クレジット利用履歴
ko: 크레딧 입출 내역

# settings.subscription.validUntil
source: 有效期至
en: Valid Until
fr: Valable jusqu'au
ja: 有効期限
ko: 유효 기간

# settings.subtitle
source: 管理花店订阅会员、充值点数及花店日常风控配置
en: Manage store membership, recharge credits and configure shop alerts
fr: Gérer l'accès API, le budget de jetons et la surveillance de l'utilisation
ja: 画像生成AI APIアクセス、トークン予算管理、使用状況の監視
ko: 이미지 생성 API 접근, 토큰 예산 관리 및 모니터링

# settings.test.success
source: 连接成功！API 正常响应。
en: Connected successfully! API responded.
fr: Connexion réussie ! L'API répond normalement.
ja: 接続成功！APIが正常に応答しました。
ko: 연결 성공! API가 정상 응답했습니다.

# settings.testConnection
source: 测试连通性
en: Test Connection
fr: Tester la Connexion
ja: 接続テスト
ko: 연결 테스트

# settings.textModel
source: 文本推理模型
en: Text Model
fr: Modèle Texte
ja: テキストモデル
ko: 텍스트 모델

# settings.title
source: 系统设置与点数中心
en: Settings & Credits
fr: Paramètres Système
ja: システム設定
ko: 시스템 설정

# settings.usage.approaching
source: 接近预算
en: Near Budget
fr: Approche de la limite
ja: 予算の限界に近い
ko: 예산 한도 접근

# settings.usage.chartTitle
source: 近7日消耗趋势
en: Last 7 Days Usage
fr: Tendance 7 derniers jours
ja: 過去7日間の使用傾向
ko: 최근 7일 사용 추이

# settings.usage.count
source: 次数
en: Count
fr: Nombre
ja: 回数
ko: 횟수

# settings.usage.date
source: 日期
en: Date
fr: Date
ja: 日付
ko: 날짜

# settings.usage.export
source: 导出
en: Export
fr: Exporter
ja: エクスポート
ko: 내보내기

# settings.usage.noRecords
source: 暂无记录
en: No Records
fr: Aucun enregistrement
ja: 記録なし
ko: 기록 없음

# settings.usage.overview
source: 消耗概览
en: Usage Overview
fr: Aperçu de la Consommation
ja: 使用状況概要
ko: 사용량 개요

# settings.usage.remaining
source: 剩余: {{val}}
en: Remaining: {{val}}
fr: Restant: {{val}}
ja: 残り: {{val}}
ko: 남음: {{val}}

# settings.usage.reportTitle
source: 消耗日报
en: Daily Usage Report
fr: Rapport de Consommation
ja: 使用状況レポート
ko: 사용 보고서
